yushuo-ko/rtl8752h_sdk/src/platform/dfu_flash.c
#include <string.h>
#include <stddef.h>
#include "trace.h"
#include "aes_api.h"
#include "patch_header_check.h"
#include "hw_aes.h"
#include "rtl876x_hw_aes.h"
#include "otp.h"
#include "dfu_api.h"
#include "rtl876x_wdg.h"
#include "dfu_flash.h"
#include "rtl876x_hw_sha256.h"
#include "board.h"
#include "otp_config.h"

#ifdef SUPPORT_SINGLE_BANK_OTA_USER_DATA
#if ((USER_DATA_START_ADDR & (FLASH_NOR_BLOCK_SIZE - 1)) != 0)
#error "User data start addr is not 64KB Aligned!!"
#endif
#endif

/*============================================================================*
 *                              Macros
 *============================================================================*/
#define BTAON_FAST_REBOOT_SW_INFO0              0x2

#define DECODE_OFFSET                           (sizeof(T_COMPRESS_IMG_HEADER_FORMAT))
#define COMPRESS_HEADER_SHA256_OFFSET           36

#define CRC_BUFFER_SIZE                         128  //may modify to improve performance
#define SHA256_BUFFER_SIZE                      128

#define SHA256_LENGTH                           32

#define DFU_UPDATE_LEN                          256

/*============================================================================*
 *                               Types
 *============================================================================*/
typedef union _BTAON_FAST_REBOOT_SW_INFO0_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd0:                      5;
        uint16_t is_ota:                     1;  /* bit[5]: enter ota mode after reset           */
        uint16_t rsvd1:                      10;
    } flag;
} BTAON_FAST_REBOOT_SW_INFO0_TYPE;

/*============================================================================*
 *                               Variables
 *============================================================================*/
static uint32_t img_total_len = 0;
static uint32_t total_block_cnt = 0;
static uint32_t block_cnt = 0;
uint8_t g_flash_old_bp_lv = 0xff;
/*============================================================================*
 *                              Local Functions
 *============================================================================*/
static void dfu_process_image_sha256(HW_SHA256_CTX *ctx, uint8_t *buf, uint32_t buf_max_size,
                                     uint8_t *pdata,
                                     size_t data_len)
{
    uint32_t i;
    uint32_t loop_cnt, remain_size;

    loop_cnt = data_len / buf_max_size;
    remain_size = data_len % buf_max_size;

    for (i = 0; i < loop_cnt; ++i)
    {
        flash_nor_read_locked((uint32_t)pdata, buf, buf_max_size);
        if (i == 0)
        {
            //because not_ready is included when calculate image sha256
            ((T_IMG_CTRL_HEADER_FORMAT *)buf)->ctrl_flag.flag_value.not_ready = 0;
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
            if (IMAGE_COMPRESSED == ((T_IMG_CTRL_HEADER_FORMAT *)buf)->ctrl_flag.flag_value.image_type)
            {
                /*access ram addr, make sure image is not ready*/
                ((T_IMG_CTRL_HEADER_FORMAT *)buf)->ctrl_flag.flag_value.compressed_not_ready = 0;
            }

#endif
        }

        hw_sha256_cpu_update(ctx, buf, buf_max_size);
        pdata += buf_max_size;
    }
    if (remain_size)
    {
        flash_nor_read_locked((uint32_t)pdata, buf, remain_size);
        if (loop_cnt == 0)
        {
            ((T_IMG_CTRL_HEADER_FORMAT *)buf)->ctrl_flag.flag_value.not_ready = 0;
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
            if (IMAGE_COMPRESSED == ((T_IMG_CTRL_HEADER_FORMAT *)buf)->ctrl_flag.flag_value.image_type)
            {
                /*access ram addr, make sure image is not ready*/
                ((T_IMG_CTRL_HEADER_FORMAT *)buf)->ctrl_flag.flag_value.compressed_not_ready = 0;
            }

#endif
        }

        hw_sha256_cpu_update(ctx, buf, remain_size);
    }
}


#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
static bool dfu_check_compressed_image_sha256(T_COMPRESS_IMG_HEADER_FORMAT *p_header)
{
    /*
           Image layout is as below, and CRC will include part 2)
           1) Image Compress Header    96 bytes
           2) compressed app + header  bytes  -sha256
        */
    uint32_t sha256sum[SHA256_BYTE_SIZE / 4];
    uint8_t sha256img[SHA256_BYTE_SIZE];
    uint8_t buf[SHA256_BUFFER_SIZE] = {0};

    HW_SHA256_CTX ctx = {0};
    hw_sha256_init();
    hw_sha256_start(&ctx, NULL);

    uint8_t *pdata = (uint8_t *)p_header + sizeof(T_COMPRESS_IMG_HEADER_FORMAT);
    dfu_process_image_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, p_header->ctrl_header.payload_len);

    hw_sha256_finish(&ctx, sha256sum);

    pdata = (uint8_t *)p_header + COMPRESS_HEADER_SHA256_OFFSET;
    flash_nor_read_locked((uint32_t)pdata, sha256img, SHA256_LENGTH);

    return (memcmp(sha256img, sha256sum, SHA256_LENGTH) == 0);

}

/**
 * @brief  calculated checksum(CRC16 or SHA256 determined by image) over the image, and compared
 *         with given checksum value.
 * @param  p_header image header info of the given image.
 * @return true if image integrity check pass via checksum compare, false otherwise.
*/
static bool check_compressed_image_chksum(T_IMG_HEADER_FORMAT *p_header)
{
    return dfu_check_compressed_image_sha256((T_COMPRESS_IMG_HEADER_FORMAT *)p_header);
}
#endif

static bool dfu_check_sha256(T_IMG_HEADER_FORMAT *p_header)
{
    uint32_t sha256sum[SHA256_LENGTH / 4];
    uint8_t sha256img[SHA256_LENGTH];
    uint8_t buf[SHA256_BUFFER_SIZE] = {0};
    uint32_t len;
    uint8_t *pdata = (uint8_t *)&p_header->ctrl_header;


    flash_nor_read_locked((uint32_t)pdata + offsetof(T_IMG_CTRL_HEADER_FORMAT, payload_len),
                          (uint8_t *)&len, 4);
    len += sizeof(T_IMG_HEADER_FORMAT) - sizeof(T_AUTH_HEADER_FORMAT);

    HW_SHA256_CTX ctx = {0};
    hw_sha256_init();
    hw_sha256_start(&ctx, NULL);

    dfu_process_image_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, len);

    hw_sha256_finish(&ctx, sha256sum);

    flash_nor_read_locked((uint32_t)&p_header->auth.image_hash, sha256img, SHA256_LENGTH);

    return (memcmp(sha256img, sha256sum, SHA256_LENGTH) == 0);
}

/**
 * @brief erase a sector of the flash.
 * @param  addr   flash addr in sector to be erase.
 * @return  0 if erase successfully, fail otherwise
*/
static bool flash_erase_sector(uint32_t addr)
{
    bool result = false;
    result = (flash_nor_erase_locked(addr, FLASH_NOR_ERASE_SECTOR) == FLASH_NOR_RET_SUCCESS);
    DFU_PRINT_INFO2("<==dfu flash erase sector: addr=%x, result=%d(1:success)", addr, result);
    return result;
}

/**
 * @brief erase a block of the flash.
 * @param  addr   flash addr in sector to be erase.
 * @return  0 if erase successfully, fail otherwise
*/
static bool flash_erase_block(uint32_t addr)
{
    bool result = false;
    result = (flash_nor_erase_locked(addr, FLASH_NOR_ERASE_BLOCK)  == FLASH_NOR_RET_SUCCESS);
    DFU_PRINT_INFO2("<==dfu flash erase block: addr=%x, result=%d(1:success)", addr, result);
    return result;
}

/**
* @brief check flash area is blank
* @param  image_id          image_id to identify FW.
* @param  offset             offset of the image.
* @param  size               size to check.
* @return  0 if blank check successfully, error line number otherwise
*/
static uint32_t dfu_flash_check_blank(uint16_t image_id, uint32_t offset, uint16_t size)
{
    uint32_t i = 0;
    uint32_t result = 0;
    uint32_t start_addr = 0;

    if (size & 0x3)
    {
        result = __LINE__;
        goto L_Return;
    }

    if ((image_id != IMAGE_USER_DATA) && (image_id != IMAGE_USER_DATA2) &&
        (image_id < OTA || image_id >= IMAGE_MAX))
    {
        result = __LINE__;
        goto L_Return;
    }

    start_addr = dfu_get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id) + offset;

    if (start_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    for (i = 0; i < size / 4; i++)
    {
        uint32_t r_data;
        if (flash_nor_auto_read_locked(start_addr, &r_data))
        {
            if (r_data != 0xFFFFFFFF)
            {
                result = __LINE__;
                goto L_Return;
            }
            start_addr += 4;
        }
        else
        {
            result = __LINE__;
            goto L_Return;
        }
    }

