yushuo-ko/rtl8752h_sdk/src/platform/dfu_flash.c
L_Return:
    DFU_PRINT_INFO4("<==dfu_flash_check_blank: image_id=0x%x, size=%d, addr=%d, result=%d",
                    image_id, size, start_addr, result);
    return result;
}

/**
 * @brief  set specified image valid bit..
 * @param  p_header      specified image.
 * @return true if ready bit sets to 0, false otherwise
*/
void dfu_set_compressed_ready(T_IMG_HEADER_FORMAT *p_header)
{
    /* clear not_ready and compressed_not_ready bit */
    uint8_t image_header[DFU_HEADER_SIZE];

    flash_nor_read_locked((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);

    ((T_IMG_CTRL_HEADER_FORMAT *)image_header)->ctrl_flag.flag_value.compressed_not_ready = 0;

    flash_nor_write_locked((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);
}

/**
 * @brief  set specified image valid bit..
 * @param  p_header      specified image.
 * @return true if ready bit sets to 0, false otherwise
*/
void dfu_set_ready(T_IMG_HEADER_FORMAT *p_header)
{
    uint8_t image_header[DFU_HEADER_SIZE];

    flash_nor_read_locked((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);

    ((T_IMG_CTRL_HEADER_FORMAT *)image_header)->ctrl_flag.flag_value.not_ready = 0;

    flash_nor_write_locked((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);
}

void dfu_set_obsolete(T_IMG_HEADER_FORMAT *p_header)
{
    uint8_t image_header[DFU_HEADER_SIZE];

    flash_nor_read_locked((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);
    ((T_IMG_CTRL_HEADER_FORMAT *)image_header)->ctrl_flag.flag_value.not_obsolete = 0;

    flash_nor_write_locked((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);
}

uint32_t dfu_get_active_bank_image_addr_by_img_id(T_IMG_ID image_id)
{
    if (image_id == IMAGE_USER_DATA)
    {
        return flash_nor_get_bank_addr(FLASH_BKP_DATA1) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else if (image_id == IMAGE_USER_DATA2)
    {
        return flash_nor_get_bank_addr(FLASH_BKP_DATA2) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else
    {
        return get_header_addr_by_img_id(image_id);
    }
}

uint32_t dfu_get_temp_ota_bank_addr_by_img_id(T_IMG_ID image_id)
{
    if (image_id == IMAGE_USER_DATA)
    {
        return flash_nor_get_bank_addr(FLASH_BKP_DATA1) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else if (image_id == IMAGE_USER_DATA2)
    {
        return flash_nor_get_bank_addr(FLASH_BKP_DATA2) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else
    {
        return get_temp_ota_bank_addr_by_img_id(image_id);
    }
}

uint32_t dfu_get_temp_ota_bank_size_by_img_id(T_IMG_ID image_id)
{
    if (IMAGE_USER_DATA == image_id)
    {
        return flash_nor_get_bank_size(FLASH_BKP_DATA1);
    }
    else if (IMAGE_USER_DATA2 == image_id)
    {
        return flash_nor_get_bank_size(FLASH_BKP_DATA2);
    }
    else
    {
        return get_temp_ota_bank_size_by_img_id((T_IMG_ID)image_id);
    }
}

/**
* @brief check ota image size whether exceed flash layout address.
*/
static bool check_dfu_update_image_length(uint16_t image_id, uint32_t offset, uint32_t length,
                                          void *p_void, uint32_t *ret)
{
    uint32_t temp_bank_size = 0;
    *ret = 0;

    if (p_void == NULL)
    {
        *ret = __LINE__;
        return false;
    }

    temp_bank_size = dfu_get_temp_ota_bank_size_by_img_id((T_IMG_ID)image_id);

    if (offset == 0)
    {
        T_IMG_HEADER_FORMAT *p_header = (T_IMG_HEADER_FORMAT *) p_void;
        uint32_t total_length = p_header->ctrl_header.payload_len + IMG_HEADER_SIZE;
        if (total_length > temp_bank_size)
        {
            DBG_DIRECT("New Image too large! total_length=%d, temp_bank_size=%d", total_length,
                       temp_bank_size);
            *ret = __LINE__;
            return false;
        }
    }

    if (offset + length > temp_bank_size)
    {
        DFU_PRINT_ERROR3("New Image single packet too large! offset=%d, length=%d, temp_bank_size=%d",
                         offset, length, temp_bank_size);
        *ret = __LINE__;
        return false;
    }

    //check pass
    return true;
}

static uint32_t dfu_write(uint32_t start_addr, uint32_t length, uint8_t *p_void)
{
    uint32_t result = 0;
    uint16_t loop_cnt = 0;
    uint16_t remain_size = 0;
    uint8_t s_val[DFU_UPDATE_LEN];

    loop_cnt = length / DFU_UPDATE_LEN;
    remain_size = length % DFU_UPDATE_LEN;
    DFU_PRINT_INFO2("dfu_write: start_addr=0x%x, length=%d",
                    start_addr, length);

    for (int i = 0; i < loop_cnt; i++)
    {
        if (flash_nor_write_locked(start_addr + i * DFU_UPDATE_LEN, p_void + i * DFU_UPDATE_LEN,
                                   DFU_UPDATE_LEN)  == FLASH_NOR_RET_SUCCESS)
        {

            if (flash_nor_read_locked(start_addr + i * DFU_UPDATE_LEN, s_val,
                                      DFU_UPDATE_LEN) == FLASH_NOR_RET_SUCCESS)
            {
                if (0 != memcmp(s_val, p_void + i * DFU_UPDATE_LEN, DFU_UPDATE_LEN))
                {
                    return __LINE__;
                }
            }
            else
            {
                return __LINE__;
            }
        }
        else
        {
            return __LINE__;
        }
    }

    if (remain_size)
    {
        if (flash_nor_write_locked(start_addr + loop_cnt * DFU_UPDATE_LEN,
                                   p_void + loop_cnt * DFU_UPDATE_LEN, remain_size) == FLASH_NOR_RET_SUCCESS)
        {
            if (flash_nor_read_locked(start_addr + loop_cnt * DFU_UPDATE_LEN, s_val,
                                      remain_size) == FLASH_NOR_RET_SUCCESS)
            {
                //ensure p_void is ram addr
                if (0 != memcmp(s_val, p_void + loop_cnt * DFU_UPDATE_LEN, remain_size))
                {
                    return __LINE__;
                }
            }
            else
            {
                return __LINE__;
            }
        }
        else
        {
            return __LINE__;
        }
    }

    return result;
}

