yushuo-ko/rtl8752h_sdk/src/platform/dfu_flash.c
L_Return:
    DFU_PRINT_INFO2("dfu_flash_erase_with_retry: cnt=%d, result=%d",
                    cnt, result);
    return result;
}


/**
 * @brief  write specified image data with specified length to flash
 * @param  image_id          image_id to identify FW.
 * @param  offset             offset of the image.
 * @param  length             length of data.
 * @param  p_void             pointer to data.
 * @return 0 if write FW image successfully, error line number otherwise
*/
uint32_t dfu_update(uint16_t image_id, uint32_t offset, uint32_t total_offset, uint32_t length,
                    uint32_t *p_void)
{
    uint32_t result = 0;
    uint32_t dfu_base_addr = 0;
    uint32_t start_addr = 0;
    bool erase_rst = true; //default value must be true

    DFU_PRINT_INFO3("==>dfu_update: offset=0x%x, total_offset=0x%x, length=%d", offset, total_offset,
                    length);

    if (length % 4)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (p_void == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    dfu_base_addr = dfu_get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);

    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    /* before erase temp image or write image to flash temp, check access length depend flash layout */
    if (!check_dfu_update_image_length(image_id, offset, length, p_void, &result))
    {
        goto L_Return;
    }

    /*if it's start_packet*/
    if (offset == 0 && length > offsetof(T_IMG_HEADER_FORMAT, uuid))
    {
        T_IMG_HEADER_FORMAT *p_header = (T_IMG_HEADER_FORMAT *) p_void;
        /*access ram addr, make sure image is not ready*/
        p_header->ctrl_header.ctrl_flag.flag_value.not_ready = 0x1;
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
        if (IMAGE_COMPRESSED == p_header->ctrl_header.ctrl_flag.flag_value.image_type)
        {
            /*access ram addr, make sure image is not ready*/
            p_header->ctrl_header.ctrl_flag.flag_value.compressed_not_ready = 0x1;
        }

#endif
        if (IMAGE_USER_DATA == image_id || IMAGE_USER_DATA2 == image_id)
        {
            img_total_len = p_header->ctrl_header.payload_len + IMG_HEADER_SIZE;

            if (0 == (dfu_base_addr & (FLASH_NOR_BLOCK_SIZE - 1)))  //start addr 64k align
            {
                total_block_cnt = img_total_len / FLASH_NOR_BLOCK_SIZE;
                DFU_PRINT_TRACE2("<==dfu_update: img_total_len=0x%x, total_block_cnt=%d",
                                 img_total_len, total_block_cnt);
            }
            else
            {
                /*improve user data ota performance with the limitation of start addr aligned 64K*/
                DBG_DIRECT("Error User data start addr not aligned 64K!");

                result = __LINE__;
                goto L_Return;
            }

            if (0 != (img_total_len & (FLASH_NOR_BLOCK_SIZE - 1)))  //img_total_len is not align 64KB
            {
                if (length > FLASH_NOR_SECTOR_SIZE)
                {
                    /*DFU_TEMP_BUFFER_SIZE can't larger than 4KB if user data size not aligned 64KB,
                    otherwise DFU_TEMP_BUFFER_SIZE can't larger than 64KB when user data size aligned 64KB*/
                    DBG_DIRECT("Error DFU_TEMP_BUFFER_SIZE > 4KB");

                    result = __LINE__;
                    goto L_Return;

                }
            }
        }

        DFU_PRINT_TRACE3("<==dfu_update: New Image Header=0x%x, image_id=0x%x, dfu_base_addr=0x%x",
                         length, image_id, dfu_base_addr);
    }

    start_addr = dfu_base_addr + offset;

    unlock_flash_bp_all();
    if (IMAGE_USER_DATA == image_id || IMAGE_USER_DATA2 == image_id)
    {
        if (block_cnt < total_block_cnt)
        {
            if (start_addr % FLASH_NOR_BLOCK_SIZE == 0)   //new Block starts
            {
                erase_rst = flash_erase_block(start_addr);
                block_cnt ++;
            }
            else  // only cross two block
            {
                if ((start_addr / FLASH_NOR_BLOCK_SIZE) != ((start_addr + length) / FLASH_NOR_BLOCK_SIZE))
                {
                    if ((start_addr + length) % FLASH_NOR_BLOCK_SIZE)
                    {
                        erase_rst = flash_erase_block((start_addr + length) & ~(FLASH_NOR_BLOCK_SIZE - 1));
                        block_cnt ++;
                    }
                }
            }
        }
        else
        {
            /*img_total_len is not align 64KB, need erase sector*/
            if (0 != (img_total_len & (FLASH_NOR_BLOCK_SIZE - 1)))
            {
                if (start_addr % FLASH_NOR_BLOCK_SIZE == 0)   //new sector starts
                {
                    erase_rst = flash_erase_sector(start_addr);
                }
                else  // only cross two sector
                {
                    if ((start_addr / FLASH_NOR_SECTOR_SIZE) != ((start_addr + length) / FLASH_NOR_SECTOR_SIZE))
                    {
                        if ((start_addr + length) % FLASH_NOR_SECTOR_SIZE)
                        {
                            erase_rst = flash_erase_sector((start_addr + length) & ~(FLASH_NOR_SECTOR_SIZE - 1));
                        }
                    }
                }
            }
        }
    }
    else  //other images
    {
        /*other images need add total offset in temp bank*/
        start_addr += total_offset;

        if ((start_addr % FLASH_NOR_SECTOR_SIZE) == 0)   //new sector starts
        {
            erase_rst = flash_erase_sector(start_addr);
        }
        else // only cross two sector
        {
            /*write space cross two sector. Note: dfu_base_addr have been 4K align*/
            /*if buffer size more than 4K, may cross more than two sectors*/
            if ((start_addr / FLASH_NOR_SECTOR_SIZE) != ((start_addr + length) / FLASH_NOR_SECTOR_SIZE))
            {
                if ((start_addr + length) % FLASH_NOR_SECTOR_SIZE)
                {
                    erase_rst = flash_erase_sector((start_addr + length) & ~(FLASH_NOR_SECTOR_SIZE - 1));
                }
            }
        }
    }
    if (!erase_rst)
    {
        //erase fail
        result = __LINE__;
        goto L_Return;
    }

    //write data to flash
    result = dfu_write(start_addr, length, (uint8_t *)p_void);
    lock_flash_bp();

